const data = {
  river: {
    title: "Дніпро",
    description:
      "Четверта за довжиною і третя за площею басейну річка Європи, з найдовшою течією в Україні. У природному стані довжина Дніпра становила 2 285 км, у межах України — 981 км.",
  },
  darnytskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%94%D0%B0%D1%80%D0%BD%D0%B8%D1%86%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Дарницький район",
    description:
      "У районі, де станом на 01 січня 2019 року мешкає 343 384 осіб, понад 90 тис. осіб - це діти. Кожному четвертому мешканцю Дарницького району ще не виповнилося 18 років.",
    area: "134",
    population: "343 384",
  },
  desnianskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%94%D0%B5%D1%81%D0%BD%D1%8F%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD_(%D0%9A%D0%B8%D1%97%D0%B2)",
    title: "Деснянський район",
    description:
      "Розкинувся у північно-східній частині міста. Як адміністративно-територіальна одиниця у складі Києва утворений 30 грудня 1987 року і названий Ватутінським на честь радянського військового діяча Миколи Ватутіна. Ватутінський район у жовтні 2001 року було перейменовано на Деснянський.",
    area: "148",
    population: "368 400",
  },
  dniprovskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD_(%D0%9A%D0%B8%D1%97%D0%B2)",
    title: "Дніпровський район",
    description:
      "Другий у місті за кількістю населення (354 тисячі жителів). Розташований на лівому березі Дніпра.",
    area: "66,7",
    population: "354 680",
  },
  holosiiv: {
    url: "https://uk.wikipedia.org/wiki/%D0%93%D0%BE%D0%BB%D0%BE%D1%81%D1%96%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Голосіївський район",
    description:
      "Найбільший за площею. Утворено у жовтні 2001 року внаслідок адміністративно-територіальної реформи на базі Московського району.",
    area: "156,35",
    population: "251 021",
  },
  obolonskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%9E%D0%B1%D0%BE%D0%BB%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Оболонський район",
    description:
      "Як територіальну одиницю утворено 3 березня 1975 року і названо на честь столиці Білорусі — Мінським. До тодішнього Мінського району ввійшли території Куренівки, Мінського масиву, Пріорки, Оболоні.",
    area: "110,2",
    population: "320 300",
  },
  pecherskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%9F%D0%B5%D1%87%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Печерський район",
    description:
      "найменший за територією та населенням район міста Києва. На його території, окрім промислових, наукових, навчальних та культурних закладів, розташовані Офіс Президента України, Верховна Рада України, Кабінет Міністрів України, Національний банк України, Прокуратура України, Палац спорту, головні офіси багатьох українських банків та корпорацій.",
    area: "27",
    population: "151 977",
  },
  podil: {
    url: "https://uk.wikipedia.org/wiki/%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD_(%D0%9A%D0%B8%D1%97%D0%B2)",
    title: "Подільський район",
    description:
      "Створений у 1921 році. Радянською владою район був перейменований на Петровський, однак 15 серпня 1944 р. району повернули історичну назву.",
    area: "34,04",
    population: "	198 123",
  },
  shevchenkivskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%A8%D0%B5%D0%B2%D1%87%D0%B5%D0%BD%D0%BA%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD_(%D0%9A%D0%B8%D1%97%D0%B2)",
    title: "Шевченківський район",
    description: "Створений згідно з постановою ЦВК УРСР 4 квітня 1937 року.",
    area: "27",
    population: "227 730",
  },
  solomianskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%A1%D0%BE%D0%BB%D0%BE%D0%BC%27%D1%8F%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Солом'янський район",
    description:
      "Було утворено у жовтні 2001 року в результаті адміністративно-територіальної реформи[3] на базі Жовтневого та більшої частини Залізничного районів.",
    area: "40,05",
    population: "364 785",
  },
  sviatoshynskyi: {
    url: "https://uk.wikipedia.org/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%88%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD",
    title: "Святошинський район",
    description:
      "Сучасну назву й кордони отримав 27 квітня 2001 року, до цього мав назву Ленінградський. За своєю протяжністю становить понад 12 км. На території району розташовано 5 парків, загальною площею 65,75 га.",
    area: "110",
    population: "340 673",
  },
};

const app = new Vue({
  el: "#app",
  data: {
    selectedDivision: null,
  },
  methods: {
    mouseover: function (event) {
      const title = event.target.parentNode.id;
      const selected = data[title];
      this.selectedDivision = selected;
    },
    mouseleave: function (event) {
      this.selectedDivision = null;
    },
  },
});
